{
	"template": {
		"definition": {
			"type": "learning",
			"name": "cardano-drep-pioneer-program-workshop-kit",
			"url": "http://sancho.network/drep-pioneer-program/drep-pp/lesson-plan/",
			"urlcaption": "sancho.network Lesson Plan (Source)",
			"controller": "do:ordered",
			"title": "Cardano DRep Pioneer Program Workshop Kit",
			"urlCaption": "....",
			"version": {
				"number": "0.0.1",
				"date": "29 MAY 2024",
				"notes": "Initial set up"
			},
			"source": {
				"sharing": {
					"type": "Creative Commons CC0",
					"description": "Creative Commons CC0 Universal (Public Domain Dedication)."
				},
				"name": "IntersectMBO",
				"notes": "",
				"url": "http://sancho.network/drep-pioneer-program/drep-pp/lesson-plan"
			},
			"sharing": {
				"type": "Creative Commons CC0",
				"description": "Creative Commons CC0 Universal (Public Domain Dedication).",
				"notes": "Created by the selfdriven Foundation.",
				"resources": [
					{
						"type": "image-thumbnail",
						"url": "",
						"imageURL": ""
					}
				]
			},
			"domains": [
				"Governance",
				"Economics",
				"Environment",
				"Civics-Citizenship",
				"Community Services",
				"Education",
				"Information Technology",
				"Social Context",
				"Technologies"
			],
			"usage": "Help set up a learning template.",
			"summary": "Cardano dRep Workshop Preparation, Lesson Plan & Closing",
			"description": "",
			"orginator": {
				"name": "selfdriven Community",
				"sdi": ""
			},
			"durationdays": {
				"minimum": 0,
				"maximum": 0
			},
			"verification": {
				"by": [
					{
						"name": "{{orginator}}"
					},
					{
						"name": "{{connected-learning-partners}}"
					},
					{
						"name": "selfdriven Community",
						"sdi": ""
					}
				],
				"minimum-verifications": 1,
				"notes": "",
				"links": [
					{
						"name": "validator-guides",
						"caption": "Validator Guides",
						"uri": [
							"https",
							"selfdriven.education"
						],
						"format": "html"
					}
				]
			},
			"outcomes": [
				{
					"by": "learner",
					"description": "Understanding of Cardano dGov"
				},
				{
					"by": "learning-partner",
					"description": "Understanding of what it takes to be a Cardano dRep"
				}
			],
			"team": {
				"notes": "Teams or Pairs",
				"roles": [
					{
						"name": "",
						"notes": ""
					}
				]
			},
			"rules": [
				{
					"for": "learner",
					"subject": "Location",
					"description": "On-Site or Remove"
				}
			],
			"resources": [
				{
					"subject": "IntersectMBO Lesson Plan",
					"description": ".",
					"imageurl": "",
					"for": [
						"learner",
						"learning-partner"
					],
					"url": "https://sancho.network/drep-pioneer-program/drep-pp/prelude-and-intro"
				}
			],
			"milestones": [
				{
					"reference": "0",
					"subject": "Prelude and Introductions",
					"description": "",
					"tasks": [
						{
							"reference": "0-1",
							"subject": "Activity 1: Welcome Participants",
							"description": "<p>Welcome participants to the DRep Training; congratulate them for the decision to learn more about the DRep ecosystem and how they can become a DRep to participate in and vote in Cardano&rsquo;s governance.</p>\n<p>Use this time to introduce yourself and share your motivation to become a DRep. If time permits, conduct an ice-breaking activity to allow participants to introduce themselves. You can use the &ldquo;popcorn&rdquo; approach, where the last person to participate selects the next teammate to introduce themselves.</p>\n<p>Keep introductions plain and straightforward by encouraging participants to answer two or three questions, such as:</p>\n<ol>\n<li>What is your name?</li>\n<li>How long have you been in the Cardano Community?</li>\n<li>Why do you want to become a DRep?</li>\n</ol>\n<p>The &ldquo;popcorn&rdquo; approach is a double-edged sword; however, it makes the meeting more democratic, with each team member selecting their successor. However, it can also make people feel awkward if they are unfamiliar with one another. If the introductions get stuck, act as a facilitator.</p>\n<p>Be sure everyone introduces themselves before moving forward to the next activity.</p>",
							"by": "",
							"durationdays": {},
							"resources": [
								{
									"subject": "",
									"url": ""
								}
							],
							"reflections": [
								{
									"by": "",
									"method": "observation",
									"type": "",
									"description": "",
									"subject": ""
								},
								{
									"by": "",
									"method": "structured",
									"type": "",
									"description": "",
									"subject": "",
									"controller": "sort:randomise",
									"structure": {
										"options": [
											{
												"name": "opt1",
												"caption": "Opt 1",
												"points": "1",
												"sequence": ""
											},
											{
												"name": "opt2",
												"caption": "Opt 2",
												"points": "0",
												"sequence": ""
											}
										]
									}
								}
							],
							"supportitems": [
								{
									"for": "",
									"description": ""
								}
							]
						},
						{
							"reference": "0-2",
							"subject": "Activity 2: DRep Training Program Overview",
							"description": "<p>Use the session schedule to present an overview of the content you will cover during the day; avoid getting into the details to prevent additional time spent. Use the training slides to present the learning outcomes and encourage participants to ask questions during the session.</p>\n<p>Depending on your training type, in-person or online training, explain the session logistics for breaks and any relevant information.</p>\n<p>Ask any questions before moving on to the next activity.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						},
						{
							"reference": "0-3",
							"subject": "Activity 3: Key Terms",
							"description": "<p>For this activity, use the glossary in the training slides to present the key terms that participants should acknowledge to understand the forthcoming activities better.</p>\n<p>To make this activity more engaging, you can conduct trivia to ask participants if they know the definition of every concept in the glossary. You can use slides or an online tool like <a href=\"https://kahoot.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Kahoot</a> or <a href=\"https://triviamaker.com/\" target=\"_blank\" rel=\"noopener noreferrer\">TriviaMaker</a>.</p>\n<p>Ensure the terms are clear for participants before moving on to the next activity.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						}
					]
				},
				{
					"reference": "1",
					"subject": "Module 1: Cardano’s Governance and Roles",
					"description": "",
					"durationdays": {},
					"tasks": [
						{
							"reference": "1-1",
							"subject": "Activity 4: Cardano’s On-Chain Governance Design",
							"description": "<p>n this activity, participants will learn about the on-chain governance design, focusing on how the governance system is described on&nbsp;<a href=\"https://github.com/cardano-foundation/CIPs/blob/master/CIP-1694/README.md\" target=\"_blank\" rel=\"noopener noreferrer\">CIP-1694</a>.</p>\n<p>Open the training slides, navigate to the Module 1 section, and highlight the following talking points:</p>\n<ul class=\"\">\n<li>During Module 1, you will understand the key aspects of Cardano's on-chain governance design.</li>\n<li>You will gain deep insight into the expectations and responsibilities of the DRep role and understand the relevance of delegation.</li>\n</ul>\n<p>Continue to the &ldquo;Cardano&rsquo;s On-Chain Governance Design&rdquo; section and explain the three pillars of Cardano's governance in the age of Voltaire:</p>\n<ol>\n<li>Institutions</li>\n<li>Constitutional representation</li>\n<li>Democratic consent</li>\n</ol>\n<p>At this point, highlight the importance of reading CIP-1694 to understand better the proposed governance system for Cardano, which will allow on-chain decision-making.</p>\n<p>Continue with the lesson and introduce the five governance roles:</p>\n<ol>\n<li>Delegate Representative (DRep)</li>\n<li>Stake Pool Operator (SPO)</li>\n<li>Constitutional Committee (CC)</li>\n<li>Delegating ada Holders</li>\n<li>Non-Delegating ada Holders</li>\n</ol>\n<p>Understanding these roles may be challenging. A suggested approach to allowing participants a more profound understanding is to use the &ldquo;students-produced question&rdquo; approach. Asking questions is challenging, and participants can do deep thinking and learning by developing questions (<a href=\"https://journals.sagepub.com/doi/abs/10.1177/0022487109339906\" target=\"_blank\" rel=\"noopener noreferrer\">Franke et al., 2009</a>). Instead of asking participants questions about the roles to check if they understand them, encourage them to read the definitions and formulate their own questions about each role. This practice engages participants' working and long-term memory (<a href=\"https://www.taylorfrancis.com/books/mono/10.4324/9780203781197/memory-brain-magda-arnold\" target=\"_blank\" rel=\"noopener noreferrer\">Arnold, 1984</a>).</p>\n<p>After presenting the governance roles, briefly describe the processes attained to each role. Point out that the support tools for each role will be explained later.</p>\n<p>Finally, explain the overall governance action enactment process. Recall that CIP-1694 describes seven types of governance actions that can be proposed by ada holders and voted by the governance roles with voting rights (DRep, SPO, and CC member).</p>\n<p>As a proposed engagement strategy, you can create groups representing each role with voting rights and simulate voting under different scenarios using flashcards or sticky notes to record votes.</p>\n<p>Ensure there are no pending questions before moving on to the next activity</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						},
						{
							"reference": "1-2",
							"subject": "Activity 5: The DRep Role",
							"description": "<p>In this activity, participants will review the definition of the DRep role. Jump to &ldquo;The DRep Role&rdquo; section in the training slides and discuss the responsibilities and expectations of a DRep. Point out the importance of a DRep as the collective voice of the ada holders that a DRep represents.</p>\n<p>To better understand the DRep role, facilitate a discussion between the participants by asking the following questions:</p>\n<ol>\n<li>How would you describe the DRep to a newcomer to Cardano?</li>\n<li>What are the main challenges a DRep can face?</li>\n<li>As a DRep, how would you deal with a conflict of interest when voting on a governance action?</li>\n</ol>\n<p>There are no right or wrong answers to these questions; they are intended to foster collaboration between participants. Feel free to add or modify questions at your discretion.</p>\n<p>Ensure there are no pending questions before moving on to the next activity.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						},
						{
							"reference": "1-3",
							"subject": "Activity 6: Understanding Delegation",
							"description": "<p>In this activity, participants will learn about the importance of delegation and how it works. Move into the &ldquo;Understanding Delegation&rdquo; section on the training slides and start by fostering a critical thinking dialogue between the participants using&nbsp;<a href=\"https://tilt.colostate.edu/the-socratic-method/\" target=\"_blank\" rel=\"noopener noreferrer\">The Socratic Method</a>.</p>\n<p>This method involves a shared dialogue between teacher and students in a classroom setup. The teacher leads by posing thought-provoking questions. Students actively engage by asking questions of their own. The discussion goes back and forth.</p>\n<p>You can start the discussion by posing questions, such as:</p>\n<ul class=\"\">\n<li>What do you understand as &ldquo;delegation&rdquo; in Cardano&rsquo;s ecosystem context?</li>\n<li>Are you familiar with delegation outside of Cardano&rsquo;s ecosystem?</li>\n</ul>\n<p>There are no right or wrong answers. The idea is to check participants' pulse around the meaning of delegation to set a baseline before explaining why delegation is important in the context of Cardano&rsquo;s Governance.</p>\n<p>Explain why delegation is necessary and how it is used in several liquid democracy applications.</p>\n<p>Next, under the context of delegating voting rights to DReps, check participants' pulse on the following questions:</p>\n<ul class=\"\">\n<li>Why not direct voting instead of delegation?</li>\n<li>Does delegation help?</li>\n</ul>\n<p>Figure out scenarios that can illustrate the rationing proposed in the slides.</p>\n<p>When the discussion ends, ensure there are no pending questions before moving on to the next activity.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						}
					]
				},
				{
					"reference": "2",
					"subject": "Module 2: DRep Code of Conduct",
					"description": "",
					"durationdays": {},
					"tasks": [
						{
							"reference": "2-1",
							"subject": "Activity 7: Navigating the Code of Conduct",
							"description": "<p>This activity focuses on understanding the DRep&rsquo;s code of conduct to understand the ethical principles and behavioral expectations outlined in the Code of Conduct for DReps, focusing on guarding against malicious behavior.</p>\n<p>For this activity, explain to participants that they will work in groups to analyze and discuss the code of conduct.</p>\n<p>Divide participants into small groups of 3-5 members each and provide participants access to the&nbsp;<a href=\"https://docs.google.com/document/d/1uyCOzWO9uk71GRlCv_UT08Rt3kGBQMXFDXF3iiXejjU/edit#heading=h.qz1ffb3al08i\" target=\"_blank\" rel=\"noopener noreferrer\">DRep Code of Conduct</a>. In an online session, you can create groups using breakout rooms in&nbsp;<a href=\"https://support.google.com/meet/answer/13054147\" target=\"_blank\" rel=\"noopener noreferrer\">Google Meet</a>&nbsp;or&nbsp;<a href=\"https://www.zoom.com/en/products/virtual-meetings/features/breakout-rooms/\" target=\"_blank\" rel=\"noopener noreferrer\">Zoom</a>. Also, if you are conducting an in-person session, you can provide paper copies of this document.</p>\n<p>Before having the groups discuss the code of conduct, explain the following instructions:</p>\n<ol>\n<li>Explain the objective of the activity: to analyze the Code of Conduct and identify fundamental ethical principles and behavioral expectations that guard against malicious behavior from DReps.</li>\n<li>Allocate 15 minutes for each group to read the Code of Conduct and discuss its contents. Encourage participants to highlight any sections that they find particularly relevant to prevent malicious behavior.</li>\n<li>After the reading period, provide each group with flipchart paper and markers. You can use a shared online document, such as Google Docs, for online sessions.</li>\n<li>Instruct groups to visually represent the fundamental ethical principles and behavioral expectations identified in the Code of Conduct. They can use diagrams, charts, or illustrations to depict these concepts.</li>\n<li>Encourage groups to discuss and debate their interpretations of the Code of Conduct, considering different perspectives and potential scenarios where ethical principles may be tested.</li>\n<li>Allocate 20 minutes for groups to work on their visual representations.</li>\n<li>After the allotted time, ask each group to present their visual representation to the rest of the class. Allow time for questions and discussion following each presentation.</li>\n<li>Facilitate a whole-group discussion on the insights gained from the activity. Prompt participants to reflect on the importance of ethical behavior in preventing malicious actions by DReps and how the Code of Conduct serves as a guide for upholding these standards.</li>\n<li>Conclude the activity by emphasizing the role of DReps in promoting a culture of integrity and accountability.</li>\n</ol>\n<p>Thank participants for their engagement and participation in the activity. Before proceeding to the next activity, ensure there are no pending questions.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						},
						{
							"reference": "2-2"
						}
					]
				},
				{
					"reference": "3",
					"subject": "Module 3: Reward Schemes for DReps",
					"description": "",
					"durationdays": {},
					"tasks": [
						{
							"reference": "3-1",
							"subject": "Activity 8: Reflecting on DReps Compensation",
							"description": "<p>This activity focuses on discussing with participants if DReps should be compensated for their collaboration. Compensation for DReps is still an ongoing debate, so having insights from participants will enrich the rationale behind compensation.</p>\n<p>Start by presenting the proposed reward schemes to the participants using the training slides that outline the different reward structures, incentives, and criteria for DReps. Ensure that the presentation is clear, concise, and easy to understand.</p>\n<p>Divide participants into small groups, ideally consisting of diverse perspectives and backgrounds. Each group should be allowed to discuss the proposed reward schemes amongst themselves. Encourage participants to consider each scheme's potential benefits and drawbacks and any concerns or questions they may have. You can slot 10 to 15 minutes for this discussion.</p>\n<p>After the group discussions, reconvene as a whole group for a structured feedback session. Each group can designate a spokesperson to summarize their discussion and present feedback on the proposed reward schemes. Facilitate a discussion where participants can share their insights, ask questions, and provide constructive feedback.</p>\n<p>Document the participants' feedback during the session and ensure that it is compiled and shared with relevant stakeholders for consideration. Consider organizing follow-up sessions or opportunities for further discussion to address any outstanding questions or concerns raised by participants.</p>\n<p>Thank participants for their engagement and participation in the activity. Before proceeding to the next activity, ensure there are no pending questions.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						},
						{
							"reference": "3-2",
							"subject": "Activity 9: DRep Reward Schemes",
							"description": "<p>This activity focuses on explaining three variants of reward schemes. Similar to the previous activity, present the three variations of reward schemes and divide participants into small discussion groups. You can slot 20 minutes for discussion.</p>\n<p>Following the group discussions, gather the entire group for a structured feedback session. Each group should nominate a spokesperson to recap their conversation and offer feedback on the proposed variants for reward schemes. Encourage an open discussion where participants exchange insights, pose inquiries, and provide constructive input.</p>\n<p>Record the feedback provided by participants during the session, ensuring it is consolidated and distributed to pertinent stakeholders for review.</p>\n<p>Congratulate participants for their active engagement in the activity. Ensure all questions have been addressed comprehensively before transitioning to the next segment.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						}
					]
				},
				{
					"reference": "4",
					"subject": "Module 4: Joining the DReps Ecosystem",
					"description": "",
					"durationdays": {},
					"tasks": [
						{
							"reference": "4-1",
							"subject": "Activity 10: How to Become a DRep",
							"description": "<p>This is a hands-on activity in which participants will learn how to become a DRep through a demonstration.</p>\n<p>As an instructor, you will lead participants using the GovTool to follow the required steps to join as a DRep.</p>\n<p>The GovTool is currently being updated, so stay tuned for updates on this activity to learn more about conducting the demonstration.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						},
						{
							"reference": "4-2",
							"subject": "Activity 11: Engaging with the Community as a DRep",
							"description": "<p>Communication is crucial to becoming an impactful DRep, so in this activity, participants will learn the available communication channels and tools that DReps can use to engage with the Cardano Community.</p>\n<p>In this section, showcase the current channels and tools available:</p>\n<ul class=\"\">\n<li>GovTool</li>\n<li>DRep Campaign Platform</li>\n<li>Cardano Forum</li>\n<li>Social Media</li>\n</ul>\n<p>Ensure participants understand&nbsp;</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						}
					]
				},
				{
					"reference": 6,
					"subject": "Closing Activity and Wrap Up",
					"description": "",
					"durationdays": {},
					"tasks": [
						{
							"reference": "5-1",
							"subject": "Activity 12: Conclusions and Further Steps",
							"description": "<p>This final activity aims to allow participants to reflect on their learning and consolidate key takeaways from the training day.</p>\n<p>You can follow the next steps to conduct a final wrap-up activity:</p>\n<ol>\n<li>Recap the main topics covered throughout the training day, highlighting key concepts and insights related to Cardano Governance design, Governance Roles, and the process of becoming a DRep.</li>\n<li>Divide participants into small groups, ensuring a mix of individuals with varying familiarity with the subject matter.</li>\n<li>Distribute sticky notes and markers to each group. Use breakout rooms and a shared board with notes like&nbsp;<a href=\"https://miro.com/online-sticky-notes/\" target=\"_blank\" rel=\"noopener noreferrer\">Miro</a>,&nbsp;<a href=\"https://ideaflip.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Ideaflip</a>, or&nbsp;<a href=\"https://www.mural.co/use-case/sticky-notes\" target=\"_blank\" rel=\"noopener noreferrer\">Mural</a>&nbsp;in an online training session.</li>\n<li>Prompt participants to reflect individually on the following questions:\n<ul class=\"\">\n<li>What was the most valuable insight or concept you learned today?</li>\n<li>How do you plan to apply this knowledge in your role as a DRep or within your organization?</li>\n<li>Is there any aspect of the training you would like to explore or have additional questions about?</li>\n</ul>\n</li>\n<li>Encourage participants to write their responses on sticky notes (or a shared board in online sessions), capturing each response on a separate note.</li>\n<li>Once participants have had time to reflect individually, reconvene as a whole group.</li>\n<li>Invite each group to share their reflections by sticking their notes on the whiteboard or flipchart under the corresponding question.</li>\n<li>Facilitate a discussion around the shared reflections, allowing participants to elaborate on their responses and engage in dialogue with one another.</li>\n<li>Summarize the main themes and insights from the discussion, highlighting any common challenges, opportunities, or areas of interest.</li>\n</ol>\n<p>Close the session by expressing appreciation for participants' active participation and contributions throughout the training day. Reinforce the importance of ongoing learning and collaboration in the context of Cardano Governance.</p>",
							"by": "",
							"durationdays": {},
							"resources": [],
							"reflections": [],
							"supportitems": []
						}
					]
				}
			],
			"skills": {
				"required": [
					{
						"uri": "",
						"name": "",
						"sdi": "",
						"level": "00",
						"capacity": "00",
						"scope": {
							"year": ""
						}
					}
				],
				"gained": [
					{
						"uri": "",
						"name": "",
						"sdi": "",
						"level": "0",
						"capacity": "00",
						"scope": {
							"year": ""
						}
					}
				]
			}
		}
	}
}